---
title: DPartFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DPartFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 22
---

# DPartFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BindLinkWillDeleteAllPartsWarning { get; }` | `DPartFailures.BindLinkWillDeleteAllPartsWarning` | FailureDefinitionId |
| `FailureDefinitionId DeletingDPartWillDeleteAllPartsWarning { get; }` | `DPartFailures.DeletingDPartWillDeleteAllPartsWarning` | FailureDefinitionId |
| `FailureDefinitionId DeletingDPartWillDeleteMorePartsError { get; }` | `DPartFailures.DeletingDPartWillDeleteMorePartsError` | FailureDefinitionId |
| `FailureDefinitionId DeletingOriginalWillDeleteParts { get; }` | `DPartFailures.DeletingOriginalWillDeleteParts` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthAll { get; }` | `DPartFailures.DivideVolumesProfilesEdgeMatchForWidthAll` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthSome { get; }` | `DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesForWidthAll { get; }` | `DPartFailures.DivideVolumesProfilesForWidthAll` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesForWidthSome { get; }` | `DPartFailures.DivideVolumesProfilesForWidthSome` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesGapForWidthAll { get; }` | `DPartFailures.DivideVolumesProfilesGapForWidthAll` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesGapForWidthSome { get; }` | `DPartFailures.DivideVolumesProfilesGapForWidthSome` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesProfilesNonSlabSources { get; }` | `DPartFailures.DivideVolumesProfilesNonSlabSources` | FailureDefinitionId |
| `FailureDefinitionId DivideVolumesSketchesWithProfileUnfriendlyCurves { get; }` | `DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves` | FailureDefinitionId |
| `FailureDefinitionId DivisionContainsNoParts { get; }` | `DPartFailures.DivisionContainsNoParts` | FailureDefinitionId |
| `FailureDefinitionId DivisionContainsNoReferences { get; }` | `DPartFailures.DivisionContainsNoReferences` | FailureDefinitionId |
| `FailureDefinitionId ElementsAlreadyHaveParts { get; }` | `DPartFailures.ElementsAlreadyHaveParts` | FailureDefinitionId |
| `FailureDefinitionId IneligibleElementsForParts { get; }` | `DPartFailures.IneligibleElementsForParts` | FailureDefinitionId |
| `FailureDefinitionId NoPartMakerCreatedInEditMode { get; }` | `DPartFailures.NoPartMakerCreatedInEditMode` | FailureDefinitionId |
| `FailureDefinitionId PartPhaseParametersConflictWithOriginal { get; }` | `DPartFailures.PartPhaseParametersConflictWithOriginal` | FailureDefinitionId |
| `FailureDefinitionId PartsCannotBeCreatedFromInvalidGeom { get; }` | `DPartFailures.PartsCannotBeCreatedFromInvalidGeom` | FailureDefinitionId |
| `FailureDefinitionId RemovingInvalidDPartParents { get; }` | `DPartFailures.RemovingInvalidDPartParents` | FailureDefinitionId |
| `FailureDefinitionId RemovingUndividedDPartParents { get; }` | `DPartFailures.RemovingUndividedDPartParents` | FailureDefinitionId |
| `FailureDefinitionId SourceInUnloadedLink { get; }` | `DPartFailures.SourceInUnloadedLink` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```